////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// library library patcher_x86.dll
// spread freely (free of charge)
// copyright: Barinov Alexander (baratorch), e-mail: baratorch@yandex.ru
// the form of implementation of low-level hooks (LoHook) is partly borrowed from Berserker (from ERA)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// version 4.2

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// DESCRIPTION.
//
//! The library provides:
// - convenient unified centralized
// tools for installing patches and hooks
// in the code of the target program.
// - additional tools: disassembler of the lengths of the opcodes and the function
// copy code with correct transfer of opcodes jmp and call c
// relative addressing
//! Library allows
// - set both simple and complex patches.
// - set high-level hooks, replacing the original functions in
// in the target code for their own, without worrying about the registers of the processor,
// stack, and return to the original code.
// - install high-level hooks one on another

// - find out which mod (using the library) installed a specific patch / hook
// - get full access to all patches / hooks installed from other mods
// using this library
// - easily and quickly detect conflicting patches from different mods
// (using this library) 1) marking the log such conflicts as:
// - patches / hooks of different size are set to the same address
// - install patches / hooks overlapping each other with offset
// - patches are installed on top of the hooks and vice versa
// as well as 2) giving the opportunity to look at the dump (common listing) of all patches
// and hooks installed using this library at a particular time.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// LOGGING.
//
// by default in patcher_x86.dll the logging is disabled to enable it,
// you must create the patcher_x86.ini file in the same folder with the only
// write: Logging = 1 (Logging = 0 - disables logging again)
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// RULES OF USE.
//
// 1) each mod should call the GetPatcher () function 1 time, saving the result
// for example: Patcher * _P = GetPatcher ();
// 2) then using the Patcher :: CreateInstance method, you need to create
// instance of PatcherInstance with its unique name
// for example: PatcherInstance * _PI = _P-> CreateInstance ("MyMod");
// 3) then use the methods of classes Patcher and PatcherInstance
// directly to work with patches and hooks
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#pragma once

#include <utility>

#define _byte_ unsigned __int8
#define _word_ unsigned __int16
#define _dword_ unsigned __int32

// _bool_ - 4-byte logical type, like BOOL in the Win32 API
// if you really want, you can replace it with BOOL or a single-byte bool, for example

#ifndef _bool_
#define _bool_ __int32
#endif

// all addresses and part of the pointers are defined by this type,
// if it's more convenient for you, you can replace _ptr_ with any other type, void * or int, for example
typedef _dword_ _ptr_;



// in all structures and interfaces of the library there should be alignment - 4 bytes
#pragma pack(push, 4)


// type "variable", is used for the values ​​returned by Patcher :: VarInit and Patcher :: VarFind methods.
class Variable
{
public:
	// returns the value of 'variable' (thread safe handling)
	virtual _dword_ __stdcall GetValue() = 0;
	// sets the value of the 'variable' (thread safe handling)
	virtual void __stdcall SetValue(_dword_ value) = 0;
	// returns a pointer to a value (accessing the value through the pointer is not secure)
	virtual _dword_* __stdcall GetPValue() = 0;
};

// type 'register of flags', size - 32 bits
// used in HookContext
struct FlagsRegister
{
	_dword_ CF : 1; //0
	_dword_ reserved_1 : 1; //1
	_dword_ PF : 1; //2
	_dword_ reserved_3 : 1; //3
	_dword_ AF : 1; //4
	_dword_ reserved_5 : 1; //5
	_dword_ ZF : 1; //6
	_dword_ SF : 1; //7
	_dword_ TF : 1; //8
	_dword_ IF : 1; //9
	_dword_ DF : 1; //10
	_dword_ OF : 1; //11
	_dword_ IOPL : 2; //12-13
	_dword_ NT : 1; //14
	_dword_ reserved_15 : 1; //15
	_dword_ RF : 1; //16
	_dword_ VM : 1; //17
	_dword_ AC : 1; //18
	_dword_ VIF : 1; //19
	_dword_ VIP : 1; //20
	_dword_ ID : 1; //21
	_dword_ reserved_22 : 1; //22
	_dword_ reserved_23 : 1; //23
	_dword_ reserved_24 : 1; //24
	_dword_ reserved_25 : 1; //25
	_dword_ reserved_26 : 1; //26
	_dword_ reserved_27 : 1; //27
	_dword_ reserved_28 : 1; //28
	_dword_ reserved_29 : 1; //29
	_dword_ reserved_30 : 1; //30
	_dword_ reserved_31 : 1; //31
};

// HookContext structure
// used in functions of Lohook hook
struct HookContext
{
	int eax; //register EAX, read / modify		// +0
	int ecx; //register ECX, read / modify		// +4
	int edx; //register EDX, read / modify		// +8
	int ebx; //register EBX, read / modify		// +C
	int esp; //register ESP, read / modify		// +10
	int ebp; //register EBP, read / modify		// +14
	int esi; //register ESI, read / modify		// +18
	int edi; //register EDI, read / modify		// +1C

	_ptr_ return_address; //return address, read / modify	// +20

	FlagsRegister flags;						// +24
	// flags register, read / modify
	// for programming languages ​​that do not support bit fields (eg delphi)
	// flags can be defined as _dword_ type.

	// the Push function has a similar action to the PUSH processor command for the LoHook hook context
	// when used with the hook context set with WriteLoHook or CreateLoHook
